In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

Data Acquisition

In [6]:
data = pd.read_csv('marketing_campaign.csv', sep='\t')
data.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0

In [7]:
data.shape

(2240, 29)

In [8]:
data = data.dropna()

In [9]:
data.shape

(2216, 29)

In [15]:
data = data.drop(columns=['MntFruits','MntMeatProducts','MntFishProducts','MntSweetProducts','MntGoldProds','NumDealsPurchases','NumWebPurchases','NumCatalogPurchases','NumStorePurchases','NumWebVisitsMonth'])

In [17]:
data = data.drop(columns=['AcceptedCmp3','AcceptedCmp4','AcceptedCmp5','AcceptedCmp1','AcceptedCmp2','Complain','Z_CostContact','Z_Revenue','Response'])

In [18]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2216 entries, 0 to 2239
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ID              2216 non-null   int64
 1   Year_Birth      2216 non-null   int64
 2   Education       2216 non-null   object
 3   Marital_Status  2216 non-null   object
 4   Income          2216 non-null   float64
 5   Kidhome         2216 non-null   int64
 6   Teenhome        2216 non-null   int64
 7   Dt_Customer     2216 non-null   object
 8   Recency         2216 non-null   int64
 9   MntWines        2216 non-null   int64
dtypes: float64(1), int64(6), object(3)
memory usage: 190.4+ KB

Data Exploration

In [20]:
data.describe()

,ID,Year_Birth,Income,Kidhome,Teenhome,Recency,MntWines
count,2216.000000,2216.000000,2216.000000,2216.000000,2216.000000,2216.000000,2216.000000
mean,5588.353339,1968.820397,52247.251354,0.441787,0.505415,49.012635,305.091606
std,3249.376275,11.985554,25173.076661,0.536896,0.544181,28.948352,337.327920
min,0.000000,1893.000000,1730.000000,0.000000,0.000000,0.000000,0.000000
25%,2814.750000,1959.000000,35303.000000,0.000000,0.000000,24.000000,24.000000
50%,5458.500000,1970.000000,51381.500000,0.000000,0.000000,49.000000,174.500000
75%,8421.750000,1977.000000,68522.000000,1.000000,1.000000,74.000000,505.000000
max,11191.000000,1996.000000,666666.000000,2.000000,2.000000,99.000000,1493.000000

In [21]:
data.isnull().sum()

ID                0
Year_Birth        0
Education         0
Marital_Status    0
Income            0
Kidhome           0
Teenhome          0
Dt_Customer       0
Recency           0
MntWines          0
dtype: int64

In [22]:
data.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173

In [23]:
data = data.drop(columns='ID')

In [24]:
data["Dt_Customer"] = pd.to_datetime(data["Dt_Customer"])
dates = []
for i in data["Dt_Customer"]:
    i = i.date()
    dates.append(i)

C:\Users\HP\AppData\Local\Temp\ipykernel_16012\1079772089.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  data["Dt_Customer"] = pd.to_datetime(data["Dt_Customer"])

In [25]:
print(max(dates))

2014-12-06

In [26]:
print(min(dates))

2012-01-08

In [28]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2216 entries, 0 to 2239
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Year_Birth      2216 non-null   int64
 1   Education       2216 non-null   object
 2   Marital_Status  2216 non-null   object
 3   Income          2216 non-null   float64
 4   Kidhome         2216 non-null   int64
 5   Teenhome        2216 non-null   int64
 6   Dt_Customer     2216 non-null   datetime64[ns]
 7   Recency         2216 non-null   int64
 8   MntWines        2216 non-null   int64
dtypes: datetime64[ns](1), float64(1), int64(5), object(2)
memory usage: 173.1+ KB